app/Http/Controllers/UserController.php

    public function dashboard()
    {
        $pageTitle = "Dashboard-user";
        $user = Auth::user();
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->latest()->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');

        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');

        $today['earning'] = Transaction::where('user_id', $user->id)->where('gateway_transaction', 'trading')->where('type', '+')->whereDate('created_at', Carbon::today())->sum('amount');
        $total['earning'] = Transaction::where('user_id', $user->id)->where('gateway_transaction', 'trading')->where('type', '+')->sum('amount');
---
select sum(`amount`) as aggregate from `payments` where `user_id` = 13 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 13 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `payments` where `user_id` = 13 and `payment_status` = 1 order by `created_at` desc limit 1
select count(*) as aggregate from `payments` where `user_id` = 13
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 13 and `status` = 1
select count(*) as aggregate from `user_interests` where `user_id` = 13
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 13
select sum(`amount`) as aggregate from `payments` where `user_id` = 13 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 13 and `status` = 0
select sum(`amount`) as aggregate from `deposits` where `user_id` = 13 and `payment_status` = 1
select sum(`amount`) as aggregate from `transactions` where `user_id` = 13 and `gateway_transaction` = 'trading' and `type` = '+' and date(`created_at`) = '2024-02-29'
select sum(`amount`) as aggregate from `transactions` where `user_id` = 13 and `gateway_transaction` = 'trading' and `type` = '+'

    public function kycIndex(){
        $pageTitle = 'kyc status';
        $user=auth::getUser();
        $kyc=  $kyc= KycVerify::where('user_id',$user->id)->orderBy('id','desc')->get();
---
select * from `kyc_verifies` where `user_id` = 13 order by `id` desc